# St7GetNFANumModes

Returns the number of modes to be calculated in natural frequency analysis.

long St7GetNFANumModes(long uID, long* NumModes)

Input Parameters

uID

Strand7 model file ID.

Output Parameters
NumModes

Number of modes.